#                                                     Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {
    'a': 10, 
    'b': 20,
    'c':30
}

#### pd.Series(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)   One-dimensional ndarray with axis labels (including time series).

In [8]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [14]:
# series can  hold any type
pd.Series(data = [print, sum, max])

0    <built-in function print>
1      <built-in function sum>
2      <built-in function max>
dtype: object

In [15]:
ser1 = pd.Series([1, 2, 3, 4], ['USA', 'Germany', 'USSR', 'Japan'])

In [16]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [17]:
ser2 = pd.Series([1, 2, 5, 4], ['USA', 'Germany', 'Italy', 'Japan'])

In [18]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

#### Grab information from series

In [19]:
ser1['USA']

1

In [28]:
# match up based on the index. Nan if there is no match. Index based operation can be done!
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

#

#                                            Data Frames

In [7]:
from numpy.random import randn

In [33]:
# to get same randon numbers even in differenct machines.
np.random.seed(101)

In [34]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'],['W', 'X', 'Y', 'Z'])

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
# Column wise selection
df[['W', 'X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [41]:
type(df)

pandas.core.frame.DataFrame

In [42]:
type(df['W'])

pandas.core.series.Series

In [44]:
df['WX'] = df['W'] + df['X']

In [45]:
df

          W         X         Y         Z        WX
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [49]:
df.drop('A', axis = 0)

          W         X         Y         Z        WX
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [51]:
df.drop('W', axis = 1)

          X         Y         Z        WX
A  0.628133  0.907969  0.503826  3.334983
B -0.319318 -0.848077  0.605965  0.331800
C  0.740122  0.528813 -0.589001 -1.278046
D -0.758872 -0.933237  0.955057 -0.570177
E  1.978757  2.605967  0.683509  2.169552

In [53]:
df.shape

(5, 5)

In [54]:
# Selecting Row

In [55]:
df.loc['A']

W     2.706850
X     0.628133
Y     0.907969
Z     0.503826
WX    3.334983
Name: A, dtype: float64

In [57]:
df.iloc[[0,1,2]]

          W         X         Y         Z        WX
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046

In [58]:
df.loc[['A', 'B'], ['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

#

In [59]:
df.loc['A']['W']

2.706849839399938

In [60]:
df

          W         X         Y         Z        WX
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [63]:
bool_df = df > 0

In [64]:
bool_df

       W      X      Y      Z     WX
A   True   True   True   True   True
B   True  False  False   True   True
C  False   True   True  False  False
D   True  False  False   True  False
E   True   True   True   True   True

In [65]:
df[bool_df]

          W         X         Y         Z        WX
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118       NaN       NaN  0.605965  0.331800
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057       NaN
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [70]:
result_df = df[df['W'] > 0]

In [72]:
result_df

          W         X         Y         Z        WX
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [71]:
result_df['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [74]:
df[df['W'] > 0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [81]:
boolser = df['W'] > 0
result = df[boolser]
my_cols = ['X', 'Y']
result[my_cols]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [83]:
df[df['W'] > 0][['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [93]:
# and cannot be used. | as or.

df[(df['W'] > 0) & (df['X'] > 0)]

          W         X         Y         Z        WX
A  2.706850  0.628133  0.907969  0.503826  3.334983
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [94]:
df

          W         X         Y         Z        WX
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [95]:
df.reset_index()

  index         W         X         Y         Z        WX
0     A  2.706850  0.628133  0.907969  0.503826  3.334983
1     B  0.651118 -0.319318 -0.848077  0.605965  0.331800
2     C -2.018168  0.740122  0.528813 -0.589001 -1.278046
3     D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
4     E  0.190794  1.978757  2.605967  0.683509  2.169552

In [96]:
states = ['MH', 'KL', 'BANG', 'DEL', 'HY']
df['states'] = states

In [97]:
df

          W         X         Y         Z        WX states
A  2.706850  0.628133  0.907969  0.503826  3.334983     MH
B  0.651118 -0.319318 -0.848077  0.605965  0.331800     KL
C -2.018168  0.740122  0.528813 -0.589001 -1.278046   BANG
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177    DEL
E  0.190794  1.978757  2.605967  0.683509  2.169552     HY

In [98]:
df.set_index('states')

               W         X         Y         Z        WX
states
MH      2.706850  0.628133  0.907969  0.503826  3.334983
KL      0.651118 -0.319318 -0.848077  0.605965  0.331800
BANG   -2.018168  0.740122  0.528813 -0.589001 -1.278046
DEL     0.188695 -0.758872 -0.933237  0.955057 -0.570177
HY      0.190794  1.978757  2.605967  0.683509  2.169552

####                                                               Multilevel Indexing

In [10]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [11]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [8]:
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])

In [9]:
df

             A         B
G1 1 -0.487906  0.924490
   2 -0.299420 -0.883972
   3  1.282719  0.150750
G2 1  0.505990 -1.693267
   2 -0.468707  0.803149
   3  0.335728  0.584082

In [18]:
df.loc['G1'].loc[1]

A   -0.487906
B    0.924490
Name: 1, dtype: float64

In [26]:
df.xs(1, level=1)

           A         B
G1 -0.487906  0.924490
G2  0.505990 -1.693267

####                                                                                Missing Data

In [27]:
d = {
    'A' : [1, 2, np.nan],
    'B' : [5, np.nan, np.nan],
    'C' : [1, 2, 3]
}

In [28]:
df = pd.DataFrame(d)

In [29]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

df.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)

In [30]:
#drop row containing na
df.dropna()

     A    B  C
0  1.0  5.0  1

In [31]:
#drop col containing na
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [32]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [33]:
df.fillna(value='Fill Value')

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [37]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

####                                                                                              Group by

In [38]:
data = {
    'Company' : ['google', 'google', 'microsoft', 'microsoft', 'facebook', 'facebook'],
    'Person' : ['Sam', 'Carlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'Sales' : [200, 120, 340, 124, 243, 350]
}

In [39]:
df = pd.DataFrame(data)

In [40]:
df

     Company   Person  Sales
0     google      Sam    200
1     google   Carlie    120
2  microsoft      Amy    340
3  microsoft  Vanessa    124
4   facebook     Carl    243
5   facebook    Sarah    350

In [42]:
by_com = df.groupby('Company')

In [44]:
by_com.mean()

           Sales
Company
facebook   296.5
google     160.0
microsoft  232.0

In [45]:
by_com.sum()

           Sales
Company
facebook     593
google       320
microsoft    464

In [46]:
by_com.std()

                Sales
Company
facebook    75.660426
google      56.568542
microsoft  152.735065

In [49]:
df.groupby('Company').sum().loc['google']

Sales    320
Name: google, dtype: int64

In [52]:
df.groupby('Company').describe()

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
facebook    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
google      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
microsoft   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [53]:
df.groupby('Company').describe().transpose()

Company        facebook      google   microsoft
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

####                                                                                Operations

In [55]:
df = pd.DataFrame({
    'col1' : [1, 2, 3, 4],
    'col2' : [444, 555, 666, 444],
    'col3' : ['abc', 'def', 'ghi', 'xyz']
})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [58]:
# returns unqiue values
df['col2'].nunique()

3

In [59]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [65]:
df[(df['col1'] > 2) & (df['col2'] == 444) ]

   col1  col2 col3
3     4   444  xyz

In [66]:
def times2(x):
    return x*2

In [67]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [70]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [71]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [73]:
df.drop('col1', axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [74]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [75]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [77]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [78]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

####                                                                            Input and output

In [79]:
%pwd

'C:\\Users\\parvez\\Machine Learning and Data Science Libraries\\Pandas'

In [81]:
df = pd.read_csv('example.csv')

In [82]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [85]:
df.to_csv('My Output', index = False)

In [86]:
pd.read_csv('My Output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [88]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [91]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [92]:
type(data)

list